{"meta":{"title":"花的姿态","subtitle":null,"description":"象牙塔里的生活热爱者","author":"夏笔","url":"http://yoursite.com"},"pages":[{"title":"","date":"2019-03-17T09:13:42.615Z","updated":"2019-03-17T09:13:42.615Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"我的名字是夏笔，出生于90后的头，双子座，现在是帝都某高校的一名研究生。虽然一直呆在象牙塔里，但是怀抱着一颗自由的心。对于博客花的姿态，我的期望是分享一些我的生活趣事和感悟，以及一些小知识。 我的爱好:运动，虽然一直坚持不下来；旅行，虽然去过的地方不多；美食，虽然是跟着溯溯去吃；但是，总而言之，我是一个爱好广泛，积极阳光的人，爱家人，爱生活。 如果你有任何问题，请电邮 smthxabi@126.com"},{"title":"tags","date":"2018-12-31T16:00:00.000Z","updated":"2019-03-17T09:01:36.179Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"无欲则刚","slug":"20190317_无欲则刚","date":"2019-03-17T02:00:00.000Z","updated":"2019-03-17T06:34:35.389Z","comments":true,"path":"2019/03/17/20190317_无欲则刚/","link":"","permalink":"http://yoursite.com/2019/03/17/20190317_无欲则刚/","excerpt":"当人不自信的时候，越到选择的时候，越患得患失，徒增烦恼。 又是一年毕业季，找工作，去哪个城市找工作？找哪个行业的工作？对口、不对口？教职、博后、工业界？找博后，哪个老板？国内、国外？就业群里就业信息的轰炸，朋友圈里晒的各种offer，茶余饭后口口相传某个大牛的百万年薪、走上人生巅峰，这就是一个真实的毕业季。还有一大波人，比如说我，在这个时间节点上总有一种人为刀俎我为鱼肉的感觉，上面的一连串问号，哪个问号都解答不了，越想，越烦恼，越无助。不是选择太少，而是选择太多，不知道该如何取舍。","text":"当人不自信的时候，越到选择的时候，越患得患失，徒增烦恼。 又是一年毕业季，找工作，去哪个城市找工作？找哪个行业的工作？对口、不对口？教职、博后、工业界？找博后，哪个老板？国内、国外？就业群里就业信息的轰炸，朋友圈里晒的各种offer，茶余饭后口口相传某个大牛的百万年薪、走上人生巅峰，这就是一个真实的毕业季。还有一大波人，比如说我，在这个时间节点上总有一种人为刀俎我为鱼肉的感觉，上面的一连串问号，哪个问号都解答不了，越想，越烦恼，越无助。不是选择太少，而是选择太多，不知道该如何取舍。 有时候，我觉得，没有选择的时候，可能反而是幸福的。记得百年校庆的时候，招待返校的老校友，个个都是七十左右爷爷辈的老人。他们说，那个时候国家让他们学啥就学啥，毕业了国家让他们去干啥就去干啥，自己不用去想，想了也没用。这大概是上个世纪五六十年代。我的老板说，他那个时候博士毕业，有一篇PRB已经是很错的了，也不想别的，肯定是继续做科研。这大概是上个世纪八九十年代。 二十一世纪来了，翻天覆地的变化。什么事情都需要自己去做选择。成年以前还好，无知无畏，记得当年选初中，两所县里面最好的初中，记得很清楚，在某天午饭前写了两张纸，抓阄，选了后来上的那所学校。现在回过头来看，如果当时选的另外一所，可能就不会进入那么优秀的一个班集体，可能最后也就进不了园子了。但是那时候，也没有进行什么广泛的调研，也没有考虑自己五年后，十年后会怎么样。成年以后，选择接踵而来，选专业，选方向，选导师…每走一步都伴随着各种选择。 选择多是好事吗？宏观上看肯定是好事，说明社会的开放，越来越以人为本。但是微观上看，具体到不同的人，不同的年龄，不同的生活状态，反而会让当事人烦恼不堪。选择再多，在年轻的时候，因为缺乏自信，反而患得患失。有些人说，年轻的时候就应该敢打敢拼，失败了也可以从头再来；而反过来也可以说，年轻的时候，抵抗风险的能力弱，社会阅历浅，人生经历短。所以做选择时，和年龄无关，只关乎性格，以及当下的状态，前者关于长期形成的世界观和价值观，后者则是短期的环境影响。以我的性格和当下的状态，在心里经常做这样的困兽之斗: “如果怎么怎么样，万一以后怎么怎么样”“可能以后怎么怎么样，所以现在应该怎么怎么样，但是怎么怎么样”“那个人怎么怎么样，或许我怎么怎么样”一大堆周遭的例子，一大堆的可能性，但是线索细弱游丝，聪明如你也找不出一条康庄大道，直通那个叫做幸福或者成功的彼岸。怎么办，不识庐山真面目，只缘身在此山中，让我们跳出自己的圈圈，看看其他领域，其他人的选择。我总是相信，各行各业，运行规律总是差不多的。比如让我在博士第三年焦躁期，平静下来，继续做科研的原因，是我看到了科研和创业的关系。 我这次把眼光对准了演员这个职业，在某些方面上，演员和科研人员这两个职业是高度重合的，都是一类小众的职业，不容易出类拔萃（出人头地），淘汰率高，分为三六九等，路窄，基本上属于上了路就很难回头的。 我找了杨紫和彭于晏，这两个我很喜欢的演员作为例子，看了两个人的几个访谈。 杨紫从小就很喜欢表演，懵懵懂懂，在演了《家有儿女》以后，就路人皆知了，但是此后，在高中的时候，接到的戏很少，遇到了演艺事业的低谷。她在金星秀上说，演《家有儿女》的时候，宋丹丹和她说“闺女，娱乐圈挺乱的，你看你也长得不是那么好看，还是就别走这条路了吧。”我觉得这句话应该对她的影响很大，或者说在她心里埋下了一颗自我怀疑的种子，以至于演完《家有儿女》接不到戏的时候，开始动摇是不是应该坚持做演员。作为搞科研的你，是不是看完这句话有点耳熟“小明，学术圈要求越来越高，没有title待遇又不好，你看你的文章发的也不好，没有影响因子高的文章，还是别走这条路了吧”。这是很多博士生毕业决定下一步时遇到的困境。 杨紫说，她在艺考前三个月，才最后决定去报考北电中戏。但是考上北电后，演艺生涯也没有一帆风顺，接了邱莹莹和陆雪琪的角色，但都不是她第一感觉喜欢的角色，不是本色出演。但是她一直在用心努力着，自己想角色的表情动作，和编剧讨论台词，慢慢的得到大家的认可，有了更多出演主角的机会。她说，她本来不想演邱莹莹，但是她最后还是选择去做了自己不喜欢的事情，不习惯的事情，挑战自己，把它做好。她说，她在低谷的时候，仍然相信自己是独一无二的。我想，这一路的艰辛，不是几十分钟能说清的，背后的苦涩只有她自己知道。 确实有些人很早就成功了，出名了，可能他们在背后也付出了很多，也可能他们运气比较好。但是更多的人，真正是台上一分钟，台下十年功，一步一步踏踏实实走出来的。坚持，有时候比什么都重要。 第二个演员是彭于晏，他说的两点特别让我感触深刻。一是他当初选择当艺人，就是想赚钱，让家里人过上好日子。二是他一开始走的是偶像路线，拍的青春偶像剧，后来才开始拍一些比较不同的题材。比如《翻滚吧，阿信》，《破风》等。他说，他可以一直拍偶像剧，很轻松，赚的也多，人气也旺；但是他接受了不同的挑战，他说，不拍破风，他可能永远看不到一路上的美景；不拍《翻滚吧，阿信》他也没有机会去了解这些默默付出的人。“无欲则刚”，这是彭妈妈教给他的，重要的是过程，而不是结果。就是一些朴素的想法，“赚钱让家人过上好日子”让彭于晏走上了演员的道路，“多尝试不同的题材”让他走出独有的“偶像硬汉”风。 只要坚定一个信念，其他都会变得顺其自然了，选择也就不会那么困难了。 比如说我，我想一直陪着我的家人，好好照顾他们，因此我就会选择博士毕业留在国内。我当下更喜欢做研究，因此我就会选择继续留在学术界。当我在写这篇文章时，认清了这两个基本的出发点，就不再纠结了，不会再去和其他的路作比较，什么待遇，海外经历，老板的支持，优青，留校等关键词都不那么重要了。 想起小时候学的一首诗，未选择的路。拿住简单的信念，但行好事，莫问前程。 The Road Not Taken BY ROBERT FROST Two roads diverged in a yellow wood,And sorry I could not travel bothAnd be one traveler, long I stoodAnd looked down one as far as I couldTo where it bent in the undergrowth; Then took the other, as just as fair,And having perhaps the better claim,Because it was grassy and wanted wear;Though as for that the passing thereHad worn them really about the same, And both that morning equally layIn leaves no step had trodden black.Oh, I kept the first for another day!Yet knowing how way leads on to way,I doubted if I should ever come back. I shall be telling this with a sighSomewhere ages and ages hence:Two roads diverged in a wood, and I—I took the one less traveled by,And that has made all the difference. 《未选择的路》 黄色的树林里分出两条路，可惜我不能同时去涉足，我在那路口久久伫立，我向着一条路极目望去，直到它消失在丛林深处。 但我却选了另外一条路，它荒草萋萋，十分幽寂，显得更诱人，更美丽；虽然在这两条小路上，却很少留下旅人的足迹。 那天清晨落叶满地，两条路都未经脚印污染。啊，留下一条路等改日再见 !但我知道路径延绵无尽头，恐怕我难以再回返。 也许多少年后在某个地方，我将轻声叹息将往事回顾：一片树林里分出两条路 ──而我选择了人迹更少的一条，从此决定了我一生的道路。 （个人感觉第二段意译过多，翻译不准确）","categories":[],"tags":[{"name":"科研小憩","slug":"科研小憩","permalink":"http://yoursite.com/tags/科研小憩/"}]},{"title":"小城生活","slug":"20190223_小城生活","date":"2019-02-23T12:00:00.000Z","updated":"2019-02-23T16:22:01.057Z","comments":true,"path":"2019/02/23/20190223_小城生活/","link":"","permalink":"http://yoursite.com/2019/02/23/20190223_小城生活/","excerpt":"晚上和几个大学的好朋友在中关村吃完饭，一个人骑电动车回学校，骑到四环经过中关村的那个大型十字路口，停下。看着各个方向的绿灯依次亮起，车如流水般穿行着，小汽车，公交车，电动车，自行车。在这等待的短短五分钟里，突然有一种无助感、疲惫感、厌倦感。眼前四周都是高大的天桥，比一般的过街天桥更高更大一些，像是一面墙，是不是太子李建成当年在玄武门看着四周的高墙，也是这种感觉，渐渐繁荣的唐朝似乎明天再也和自己没关系了。","text":"晚上和几个大学的好朋友在中关村吃完饭，一个人骑电动车回学校，骑到四环经过中关村的那个大型十字路口，停下。看着各个方向的绿灯依次亮起，车如流水般穿行着，小汽车，公交车，电动车，自行车。在这等待的短短五分钟里，突然有一种无助感、疲惫感、厌倦感。眼前四周都是高大的天桥，比一般的过街天桥更高更大一些，像是一面墙，是不是太子李建成当年在玄武门看着四周的高墙，也是这种感觉，渐渐繁荣的唐朝似乎明天再也和自己没关系了。 记得9年前，刚刚来北京的时候，中关村应该给我这个来自小县城的少年上了大城市第一课，电脑经销商一会花言巧语，一会威逼利诱，至今历历在目。虽然第一次来就被骗了一千块，差不多是大半个月的生活费，但是当时好像也没怎么样。北京，对我来说，一切都是新的，尤其是刚刚经过枯燥的高三，又经过艰难的病痛，我好像是脱笼的小鸟，新生一般。好像心里面在说，北京，我来了，你看我来了，我说我会来的。 9年后的今天，对爱人亲人的思念，对毕业季的焦虑，对未来事业的未知，对未来生活的未知，好像一张网，让我感觉在人生的路上往前走一步都气喘吁吁。确实过了飞扬的年少，工作，薪资，买房，买车，结婚，生子，这些以前从来不会考虑的事情，现在的优先级在你考虑的因素中越来越往前。有时候，不是我想成长，生活在推着我成长。学着接受一周七日的宿舍，实验室两点一线；学着接受，食堂难言好吃，却几年不变的食物；学着接受老师给你派发的每一项任务。 多久没有好好看一眼这个可爱的城市了，北京，在十字路口短短的一瞥，似乎已经陌生了。9年的生活，似乎在这一刻比不上，9年前从火车站出来站在广场上看到你的样子，那样熟悉。多久没有轻松的听一场喜欢或者谈不上喜欢的讲座，单纯只是为了接触一点新的有意思的东西，在园子里待了9年后，似乎也没有那么熟悉了。清芬的水煎包，莲藕肉包，花生浆，在溯溯毕业后再也没吃过了。草草的几口早饭，与其说是为了果腹，不如说是为了早餐这个仪式。多久没好好的在图书馆看一会书了，多久没好好看园子里的四季，上一次在园子里乱窜，拿着相机拍拍春景，不知道是哪年了。 是读博士吗？似乎是的，读博要求你五年如一日的坚守，好像一下午休息20分钟，也是对时间的浪费。但又好像不是。读博并没有要求你放弃对生活的热爱。应该是年纪到了吧，在人生的这个阶段里，脱去了稚气，过了强说愁的年纪，但是还没到成熟到笑对生活的年纪。就像一颗青涩的果实，没了作为花朵时候的娇艳和花枝招展，但也没到秋天成熟时的硕果累累。青涩的果实，只能努力的多给自己积累一些糖分。 想起春节里，在午后温暖的阳光里，和溯溯，爸爸，妈妈，在新小区的湖边散步聊天。和溯溯，爸爸，奶奶，姑妈，在奶奶门前破旧的院子里，聊过去，折纸元宝。 小城，有新，有旧，在离开9年后的今夜，突然感觉分外的亲切，可爱，以及想念。 var ap = new APlayer({ element: document.getElementById(\"aplayer-vsMRsKtW\"), narrow: false, autoplay: true, showlrc: false, music: { title: \"起风了\", author: \"买辣椒也用券\", url: \"/music/起风了-买辣椒也用券.mp3\", pic: \"\", lrc: \"\" } }); window.aplayers || (window.aplayers = []); window.aplayers.push(ap);","categories":[],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]},{"title":"生活，继续","slug":"20190219_生活继续","date":"2019-02-19T12:00:00.000Z","updated":"2019-03-17T09:20:04.776Z","comments":true,"path":"2019/02/19/20190219_生活继续/","link":"","permalink":"http://yoursite.com/2019/02/19/20190219_生活继续/","excerpt":"很普通的一天工作日，不普通的是今天是元宵节。离毕业还有半年，一整个白天都在构思毕业PPT应该怎么组织，被搞得很头痛。我发现自己在总结东西时，总是分外的困难，depression。六点半的时候去吃晚饭，因为学校的假期还没有结束，大多数食堂还没有开门，想找一个共享单车去远一点的澜园，顺便买点水果，但是走了一路也没找到。背着还有点重的书包，在昏暗的路灯下，心中感到一丝丝的难过，是的北京又是我一个人了。","text":"很普通的一天工作日，不普通的是今天是元宵节。离毕业还有半年，一整个白天都在构思毕业PPT应该怎么组织，被搞得很头痛。我发现自己在总结东西时，总是分外的困难，depression。六点半的时候去吃晚饭，因为学校的假期还没有结束，大多数食堂还没有开门，想找一个共享单车去远一点的澜园，顺便买点水果，但是走了一路也没找到。背着还有点重的书包，在昏暗的路灯下，心中感到一丝丝的难过，是的北京又是我一个人了。 走在路上给溯溯发微信，溯溯一个人在上海，也是刚刚下班回家 “我好想你哦老婆”“哦哟，怎么这么想”“就是很想啊” 似乎结了婚以后，自己变得越来越恋家了，想念一回家看到溯溯在做菜的日子，有时候回去的早，还能帮一下大厨。想吃溯溯做的菜，想吃完饭后一起去散步。可我原本不是这样的人啊，十年前刚进大学的时候，我可是一个独来独往的人。原来，9年，一个人，可以让另一个人变化这么大。 几天前还是一家人在家欢乐的玩耍，我，溯溯，爸爸，妈妈，吃着可口的饭菜。此刻嚼着食堂快冷了的所剩的最后几份快餐，单纯是为了果腹。今天是元宵节，拨通了爸爸的微信视频， “今天元宵节，晚上吃了啥呀，爸爸”“包了馄饨”“哪天来北京啊”“十八” 每年爸爸都是过了正月十五来北京，这可能是建筑行业开工的潜规则，一年到头抛在外地，过年的时候可以好好在家陪陪老婆孩子。虽然和爸爸“一起”在北京生活了快9年，但是一个在北，一个在南。北京的高房价，决定了我们只能都各自住在各自的宿舍里，一个月见一次面已经算频繁了，高年级工作任务重了以后更是难得见一次。 吃了12分钟晚饭，也就和爸爸聊了12分钟。出食堂一看，卖水果的已经关门了。于是走进旁边的小超市，准备买点吃的。这时候接到奶奶的视频电话。奶奶本来有每周给我打电话的习惯，但是前几年她听力下降很多，每次都听不清我说什么，起先换成爷爷打，后来爷爷听力也不行了，老两口怕打扰我，也就慢慢不打了，现在可能几个月才打一次。前几个月，弟弟刚刚教会奶奶打微信视频电话，即使听不清我说的话，能看看我，他们也很高兴。 “我在逛超市呢，奶奶”“哦，身体怎么样?”从奶奶迟疑的反应中，我大概能猜出，我上一句话她没听清。“我很好，上周末回的学校，你和爷爷身体怎么样？”“很好，放心，多买点好吃的”和老人们通电话，每次就那几句话，“保重身体”，“多吃点”。看着奶奶开心的笑，我知道就这短短的几句话，几分钟，她和爷爷已经很开心了。只是有时候，我们连这几分钟的时间都不舍得给他们。 在这个元宵节里，老年人待在家里，看着年后小辈一个个都走了；中年人，也开始了退休前最后几年的工作，岁数已到，工作的压力也小了很多；而像你我一样的年轻人，在这冬天的风中，还朝着心中的梦想努力着。一家中的三代人，在这一天，你想着我，我想着他，他想着你，这不就是家吗，即使不在一处，远隔千里，依然相互思念，牵挂。想到这儿，有点想家，有点想哭。 可能生活就是这样，你怀揣着梦想，像一个战士那样战斗，但是总有那么几个夜晚，压力或者挫折让你有点怅然若失。但是或是远方或是身旁的亲人、爱人总是会给你带来温暖。此情价更高，万物皆可抛。 过了这个元宵就好了，我对自己说，生活，继续。","categories":[],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]},{"title":"只要做好一件事就够了","slug":"20161208只要做好一件事就够了","date":"2016-12-08T05:16:00.000Z","updated":"2016-12-10T08:01:12.000Z","comments":true,"path":"2016/12/08/20161208只要做好一件事就够了/","link":"","permalink":"http://yoursite.com/2016/12/08/20161208只要做好一件事就够了/","excerpt":"在知乎上看到了一个很简单，却很切实的回答。让我一看就有一种“这不就是在说我嘛！”的感觉。问题是：单身职场人士如何利用晚上八点到十点这段时间自我提高？具体请看：https://www.zhihu.com/question/20406019/answer/134639093 答主描述了一类人，很努力，甚至在业余的时间也要想方设法丰富自己，给自己充电，比如运动健身，学习英语，阅读书籍，看公开课、纪录片，学习烹饪，练习画画书法等等。但是很多的时候，都是一开始轰轰烈烈，不久之后就不了了之，或者转向了其他的方面。","text":"在知乎上看到了一个很简单，却很切实的回答。让我一看就有一种“这不就是在说我嘛！”的感觉。问题是：单身职场人士如何利用晚上八点到十点这段时间自我提高？具体请看：https://www.zhihu.com/question/20406019/answer/134639093 答主描述了一类人，很努力，甚至在业余的时间也要想方设法丰富自己，给自己充电，比如运动健身，学习英语，阅读书籍，看公开课、纪录片，学习烹饪，练习画画书法等等。但是很多的时候，都是一开始轰轰烈烈，不久之后就不了了之，或者转向了其他的方面。 其实我自己也是这样的一个人，曾经看到舞台上那些打鼓，弹吉他，键盘的业余爱好者，对他们深深的羡慕，于是想过要学习电子琴，花了很多功夫研究什么入门的电子琴型号比较好，买了一台后，又买了很多自学的教材，但是可能最后没练一个月就扔在那里了，至今还在橱里积灰。再到后来办年卡健身，可能最后按照去的次数核算下来比单次卡还要贵。这样的例子实在是太多了，读书，练字，学英语，看公开课，看纪录片，几乎答主提到的所有单项我都曾经有一段时间想要去做，但是最后都没有坚持下来。 其实我不太清楚，这种做事的风格和习惯到底是天生的还是后天养成的。我个人比较偏向于是一种天生的性格，比如看很小的小孩子玩玩具的表现，一般看到新玩具就会把旧玩具扔到一边，过了一会玩腻了，可能又去找其他的玩具。这种在不同的玩具之间跳来跳去的孩童天性，好像与长大以后在做不同的事情之间换来换去，有一样的特征。 我尝试分析一下我自己在这方面的性格特征，顺便摘抄了几条职业测评中对性格的描述。1.对很多事情都有好奇心，想尝试挑战一下。2.过于追求完美，会花很多时间酝酿自己的想法，导致行动力较弱。3.经常忽略逻辑思考和具体现实，沉浸于梦想，当意识到自己的预期与现实的差距时，容易灰心丧气。4.做事可能存在感情用事的倾向。 我觉得综合的来说，导致这样一个特点的原因是，一开始想做这件事的时候，通过别人的经历或者自己的幻想，觉得假如自己怎么怎么做，最后就会怎么怎么好。但是在一开始做的过程中，遇到了困难，或者与自己的预期不一样的时候，就退缩了，甚至放弃了。 这其实是一个非常危险的性格特点，很容易就会忙忙碌碌，但是一事无成。最简单的拿一天来说，在一天的过程中，你可能在网上刷了一会知乎觉得无聊了，又看了一会书又看不下去了，又看了一部电影，觉得挺有感触，想写写观后感，写了一半觉得没什么内涵，下次再写吧。然后想着去健个身吧，想想上次去还是上周，昨天睡的又很晚，还是明天再去吧。 针对上面提到的问题，答主的基本观点是：找到自己的兴趣点，坚持做好同一件事就足够了。我现在十分同意这个观点,所谓坚持，我觉得，就是要随时有遇到困难的准备，坚持不下去的准备，与自己预期不符的准备。在真正遇到困难，坚持不下去，与预期不符的时候，告诉自己：我早就知道有这么一天。然后对自己笑一笑，继续上路。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]},{"title":"我的Linux系统使用体验","slug":"20161117_我的Linux系统使用体验","date":"2016-11-17T10:37:42.000Z","updated":"2016-11-17T12:22:54.000Z","comments":true,"path":"2016/11/17/20161117_我的Linux系统使用体验/","link":"","permalink":"http://yoursite.com/2016/11/17/20161117_我的Linux系统使用体验/","excerpt":"简单交代一下背景，我并不是学计算机出身的，只因为科研内容与计算科学相关，而计算科学所使用的服务器绝大多数都是Linux系统，平时用的各种软件，也都是安装运行在Linux下面。因此，平时少不了要和Linux打交道。 我的Linux使用经历大概分为下面三个阶段：1.在windows下，使用Xmanager等软件，ssh远程登陆到计算服务器上使用，仅限于提交一下任务，简单的数据处理，经常碰到网络延时等造成的烦恼；2.在windows下，用vmware安装Linux虚拟机（我记得当时安装的是Redhat6.4）。解决了1中网络延时的问题，可以自己安装一部分生产力工具。很多时候需要源码安装，也麻烦。3.安装了ubuntu-14.04系统（Linux一个发行版），绝大多数工作都在ubuntu中进行，包括一小部分的业余娱乐。当然还是保留了之前的window系统，主要是处理一些其他人发给我的Office文档。","text":"简单交代一下背景，我并不是学计算机出身的，只因为科研内容与计算科学相关，而计算科学所使用的服务器绝大多数都是Linux系统，平时用的各种软件，也都是安装运行在Linux下面。因此，平时少不了要和Linux打交道。 我的Linux使用经历大概分为下面三个阶段：1.在windows下，使用Xmanager等软件，ssh远程登陆到计算服务器上使用，仅限于提交一下任务，简单的数据处理，经常碰到网络延时等造成的烦恼；2.在windows下，用vmware安装Linux虚拟机（我记得当时安装的是Redhat6.4）。解决了1中网络延时的问题，可以自己安装一部分生产力工具。很多时候需要源码安装，也麻烦。3.安装了ubuntu-14.04系统（Linux一个发行版），绝大多数工作都在ubuntu中进行，包括一小部分的业余娱乐。当然还是保留了之前的window系统，主要是处理一些其他人发给我的Office文档。 我从今年1月份的时候，才决心将日常的工作都放在Linux系统下进行。也算是用了将近一年了，工作的幸福感有了很大的提升，但是刚开始的时候也确实遇到了一些不习惯，这里与大家分享一些我的体会，以及一些我搜集到的Linux使用技巧。首先说明，我其实是一个技术小白，不喜欢折腾，所以很多下面写到的攻略，技巧，都是拿来直接用，可以说是只知其然，不知其所以然。我相信，使用Linux系统的人中，一部分也是和我一样情况的人。另外很多下面分享的东西并不一定是最优解，也有可能有错误，也请各位大神不吝赐教。 ubuntu作为一个小白最好的入门Linux系统，它的包管理软件是其一大杀手锏。1.安装软件:一般的软件sudo apt-get install &lt;package&gt; 就可以搞定。其他特殊的软件，直接google，记住你不是一个人。2.删除软件:sudo apt-get remove &lt;package&gt; &amp;&amp; sudo apt-get autoremoveorsudo aptitude remove &lt;package&gt;http://askubuntu.com/questions/1143/how-can-i-uninstall-software3.升级软件sudo apt-get updatesudo apt-get upgrade 日常必备软件安装篇：（直接可以apt安装的我就不说明了，不能直接安装的我会给出方法，或者给出方法的链接） 1.编辑器：vim默认只提供了vim.tiny(让我转到Linux的原因1，最主要原因) 2.显卡驱动：https://help.ubuntu.com/community/BinaryDriverHowto/AMD 3.浏览器：chromehttp://askubuntu.com/questions/510056/how-to-install-google-chromewget https://dl.google.com/linux/direct/google-chrome-stable_current_i386.debsudo dpkg -i google-chrome-stable_current_i386.debsudo apt-get -f install自己用惯了chrome，其实自带的firefox也很好用。 4.播放器: vlc好像用过的人都说好,中文字幕乱码的问题,将解码器改为universal chinese GB, 自体改为中文字体 5.邮件客户端，自带的thunderbird很好用。之前windows用的是foxmail，感觉无缝过渡。 6.词典：网页版youdao之前也用过goldendict，但是始终觉得永不顺手。 7.版本管理软件：git(让我转到Linux的原因2) 8.Latex软件：Texlive2016图形界面 apt-get install perl-tk安装路径 默认的为/usr/local/texlive 改为 /opt/texlivesudo chown yourname:yourname /opt/texlive./install-tl -gui -repository \\http://mirrors.tuna.tsinghua.edu.cn/CTAN/systems/texlive/tlnet/进去之后将文件夹改成/opt/texlive即可http://zhuanlan.zhihu.com/LaTeX/20069414http://tex.stackexchange.com/questions/287419/error-25-during-equivs-build-fake-packages-for-texlive2015最后一步做虚拟包不用这么复杂，可以直接运行做好的包texlive-local_2015-1_all.deb 9.pdf阅读器：okularubuntu14.04 默认的pdf阅读器evinceokular不好的地方是，它的注释windows下adobe reader/acrobat打开看不到。因为它是把注释记录在其他的一个文件中。 10.种子下载客户端： deluge教育网ipv6下载资源必备 11.百度云安装bcloud（不太稳定）https://github.com/LiuLang/bcloud-packages 安装包sudo dpkg -i bcloud-x.x.x.debsudo apt-get -f install 12.科学数据画图: gnuplot相信我，用熟了简直比origin好用太多 13.Office软件：自带的Libreoffice自己装了WPS，但是感觉各种不稳定。Libreoffice的一大好处，就是可以直接用eps矢量图，MSOffice好像并不行。 14.pandoc: markdown转换为pdf 15.文献管理软件：Mendeley文献管理软件安装说明https://www.mendeley.com/download-mendeley-desktop/ubuntu/instructions/使用教程http://tul.blog.ntu.edu.tw/archives/5344 16.中文输入法：搜狗输入法先按照搜狗官网安装fcixt和sogouhttp://pinyin.sogou.com/linux/help.php然后配置的时候找到sogou-chinese加入fcixt的快捷键切换之前一直不行，原来是因为第一个输入法（英语）是inactive的，所以要在global config 的advance 里面将scroll between inactive选上sogou输入法linux的缺点：没有同步词库的功能(搜狗输入法解决了中文用户在Linux下面生存的一大难题) 17.修图软件：GIMP image editor 18.编译器：intel编译器套装学生edu的邮箱可以免费用，简直是业界良心。(让我转到Linux的原因3) 19.听音乐：自带Rhythmbox music player 20.个人博客： Hexohttps://linux.cn/article-5930-1.htmlhttp://segmentfault.com/a/1190000002665530http://www.jianshu.com/p/05289a4bc8b2http://www.tuicool.com/articles/Jva2iaA安装新版的nvm nodehttps://github.com/IonicaBizau/git-stats-importer/issues/27 21.ssh服务，让远程的计算机可以登陆 一、采用简单的密码登陆 设置openssh-serverhttps://help.ubuntu.com/community/SSH/OpenSSH/Configuring命令sudo apt-get install openssh-serversudo cp /etc/ssh/sshd_config /etc/ssh/sshd_config.factory-defaultssudo chmod a-w /etc/ssh/sshd_config.factory-defaultssudo restart ssh最好设置禁止root用户登陆PermitRootLogin no另外的参考http://songtl.com/linux-ssh-setting.htmlhttp://ihacklog.com/post/how-to-enable-secure-shell-in-ubuntu.html 设置防火墙，开启22端口sudo ufw allow 22https://help.ubuntu.com/lts/serverguide/firewall.html 二、采用更加安全的SSH-Key登陆直接将public key放到远程的.ssh/authorized_keys文件夹中这样可以实现不用密码就可以登陆https://help.ubuntu.com/community/SSH/OpenSSH/Keys命令ssh-copy-id &lt;username&gt;@&lt;host&gt; 22.磁盘管理软件：gparted需要root执行 23.如果你担心没有itunes怎么办？我告诉你ipad插上可以直接传东西有木有！ 常用的快捷键：打开终端的快捷键ctrl+alt+T或者ctrl+shift+N在此终端中打开新的tab ctrl+shift+T切换tab的方法 ctrl+PgUp/PgDn 或者 Alt+1/2/3ubuntu workspace切换 ctrl+alt+方向键 最后说说用了这么长时间，不顺手的地方:1.其他人发过来的各种Microsoft 的word，ppt文件兼容性还不好，需要回到window下面修改。自带的libreoffice有时候会卡死，需要时常记得保存。这一点MSOffice还是做的相当不错的。MSOffice都出了Mac版了，不知道什么时候会出一个Linux版。2.没有好用的阿里巴巴Linux版，所以一直用网页版。 我当初下定决心转到Linux，是因为vim，git，intel parallel studio等软件。一开始确实会遇到各种各样的用不惯的问题，但是天天用，熟悉了以后，你会发现有很多的优势。相信我，假如你是做计算科学的，Linux桌面版是你最好的选择！还能在业余时间，写写自己的博客，何乐而不为呢！","categories":[],"tags":[{"name":"Linux","slug":"Linux","permalink":"http://yoursite.com/tags/Linux/"}]},{"title":"晚睡君，我已经决定要向你开战了","slug":"20161117_晚睡君我已经决定要向你开战了","date":"2016-11-17T01:48:00.000Z","updated":"2016-11-17T03:05:01.000Z","comments":true,"path":"2016/11/17/20161117_晚睡君我已经决定要向你开战了/","link":"","permalink":"http://yoursite.com/2016/11/17/20161117_晚睡君我已经决定要向你开战了/","excerpt":"连我自己都不知道什么时候我也变成了一个夜猫子了，最近已经连续一个多星期是一点以后睡觉了，早晨也起不来。可能是大学的时候吧，同宿舍也有一个夜猫子。我有一个怪癖，就是得等周围的人都睡了（是睡了，在床上玩手机都不行），自己才能安心睡去。久而久之，就变成了最后一个睡的人，从爬上床到睡觉，短则半个小时一个小时，长则两三个小时，无非就是看个视频，或者在网上四处看看。当时觉得，都是因为有一个夜猫子室友造成的。后来，室友变成了一个作息健康的人，他基本上都是0点之前睡的，我在他的带动下，一般1点前也就睡了，也没觉得什么。最近，室友出国了，自己一个人住，刚开始的时候还保留着他在的时候的作息。这两天不行了，自己粗略平均了一下，都在一点半以后入睡的。","text":"连我自己都不知道什么时候我也变成了一个夜猫子了，最近已经连续一个多星期是一点以后睡觉了，早晨也起不来。可能是大学的时候吧，同宿舍也有一个夜猫子。我有一个怪癖，就是得等周围的人都睡了（是睡了，在床上玩手机都不行），自己才能安心睡去。久而久之，就变成了最后一个睡的人，从爬上床到睡觉，短则半个小时一个小时，长则两三个小时，无非就是看个视频，或者在网上四处看看。当时觉得，都是因为有一个夜猫子室友造成的。后来，室友变成了一个作息健康的人，他基本上都是0点之前睡的，我在他的带动下，一般1点前也就睡了，也没觉得什么。最近，室友出国了，自己一个人住，刚开始的时候还保留着他在的时候的作息。这两天不行了，自己粗略平均了一下，都在一点半以后入睡的。 列几点晚睡对自己的坏处（纯凭个人感觉，没有科学依据）：1.白天没有精神。这来源于两个方面，一是确实睡眠不足，身体上疲惫；二是因为心理上觉得身体状况不好，精神上也萎靡不振。直接的影响是，工作的时候干劲不足，拖拖拉拉，给自己找理由偷懒；本来应该健身的日子，没有健身。2.明显的皮肤变差，各种痘痘。3.抵抗力也变差，容易感冒。4.感觉记忆力不如从前了。 知己知彼，方能百战不殆。想要战争晚睡君，就得知道他是怎么来的，这部分没有做过什么专业的调研，只是就我自己的体会，来分析一下晚睡的原因。 分析晚睡的几点原因：1.最近工作不顺，干劲也不足，受Sue妹妹找工作不顺的影响，对自己的前途也是深深的担忧，所以晚上回家了，内心底还是有深深的焦虑。因此在睡前的焦虑中会试图通过刷微博，刷知乎，不停的在信息流中漫游来找寻自己的满足感。（从网上看到的一句话：晚睡，是因为你没有勇气结束这一天）。2.晚上的自制力会变差。在晚上，尤其是黑暗中，我感觉自制力会变差（不知道有没有这方面的证据？），因此深陷于网络，更加无法自拔。 初步的对策：1.看到知乎上（如何改掉晚睡强迫症？）有人提议“做一件流畅的，完整的事情，让你心里感到满足。这件事情不能是碎片的，零散的，可以是读完整的一段文字，听完整的一张专辑，看完整的一段视频。放到我身上，一是晚上回家之后不玩手机，尤其是在12点和Sue妹妹互道晚安之后。二是，看完一章书后直接睡觉。2.近期来发现，自己一直有拖延症，尤其是在碰到困难的时候，以及手头的事情很多的时候，越需要动脑和忙的时候，越是慢吞吞，什么都不想干。所以想看看关于拖延症，时间管理这方面的书籍，之前看了李笑来的《把时间当做朋友》，没什么感觉。 从小就一直觉得自己的自制力还是可以的，那么就让我从今天开始，向晚睡君宣战吧!","categories":[],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]},{"title":"青年，中年以及老年，周末观影有感","slug":"20161115_青年","date":"2016-11-15T12:40:51.000Z","updated":"2016-11-17T13:58:38.000Z","comments":true,"path":"2016/11/15/20161115_青年/","link":"","permalink":"http://yoursite.com/2016/11/15/20161115_青年/","excerpt":"","text":"上个周末看了三部电影 我们的十年完美陌生人 Perfetti sconosciuti家族之苦 分别讲述了人生中青年，中年和老年时候的三个故事。","categories":[],"tags":[{"name":"影记","slug":"影记","permalink":"http://yoursite.com/tags/影记/"}]},{"title":"西雅图游记","slug":"20161031_西雅图游记","date":"2016-10-30T16:00:00.000Z","updated":"2016-11-17T13:56:10.000Z","comments":true,"path":"2016/10/31/20161031_西雅图游记/","link":"","permalink":"http://yoursite.com/2016/10/31/20161031_西雅图游记/","excerpt":"8月底，从北京去西雅图开会，一周。这是我第一次出国，如果不算之前去过一次香港的话。一直觉得自己的双子性格中有喜欢自由和远方的一面，所以很早就开始期待这一次的旅程。说是去参加会议，其实整个实验室就我一个人去，这更符合我的心意，一来行程不用顾忌同伴的感受，一个人说走就走; 二来，无论这一路我干了什么，也不会有第二个人知道，不用藏着端着，可以纯天性的体验。","text":"8月底，从北京去西雅图开会，一周。这是我第一次出国，如果不算之前去过一次香港的话。一直觉得自己的双子性格中有喜欢自由和远方的一面，所以很早就开始期待这一次的旅程。说是去参加会议，其实整个实验室就我一个人去，这更符合我的心意，一来行程不用顾忌同伴的感受，一个人说走就走; 二来，无论这一路我干了什么，也不会有第二个人知道，不用藏着端着，可以纯天性的体验。 第一次11小时的经济舱之旅，已经是一个不大不小的问题。因为自己有下肢静脉功能不全的毛病，家里人特意叮嘱要吃点阿司匹林预防预防，飞机上也要勤走动。自己虽然嘴上说着没事的，放心吧之类的宽慰长辈的话，心里却在不敢怠慢。特意选了靠近走道的位置，好不打扰别人。 在机场候机的最大体会就是，好多长得中国人相貌的小孩，都是一口流利自然的英语。印象最深刻的是一个母亲带着一大一小两个女孩，小的也就是四、五岁。小女孩东蹦西跳，嘴里自言自语，时不时的又跑去母亲跟前说着话。大意是，地上有一个大型的莲花的贴纸，小女孩假装捧起了这一朵莲花，送给了妈妈，姐姐要，但是不给。母亲和小女孩之间的对话，全程英语，和大女儿之间半英半中。候机处多的是这样的家庭，惹得我这个从小学开始就被英语虐的死去活来，至今和实验室的日本留学生用着中文交流的人心中不断的暗暗称奇。虽说，园子里走来走去，也有不少金发碧眼的人三三两两的聊天走过，但是近距离的观察这样的华人家庭倒也是第一次，颇有一种村里人进城的感觉。 北京去西雅图的飞机上，第一件出乎意料的事，就是看到了组里已经毕业的一个师兄，也去开会。心想，完蛋，独行的愿望泡汤了。走到座位上，旁边坐的是一个老阿姨，一路上和她简单的聊了两句，听她介绍自己是去西雅图看望女儿女婿，女儿要生娃了，去照顾一下。我也自我介绍，是去西雅图开会云云。老阿姨有糖尿病，吃东西有忌口，但是说话又带着口音，所以和空姐之间的交流，都是我做的翻译和传声筒。当然，海关报关单这样的东西也是我帮着她填的。所以，当空姐得知我和老阿姨并不认识的时候，也是吃了一惊。老阿姨最纠结的就是在抵达目的地前的一小时，因为带了一袋无糖的饼干，纠结着能不能，要不要带下飞机。携带的方案包括1.全部带下去；2.全部留在飞机上；3.带几块下去。我作为离她最近的人，首当其冲，成了她倾诉纠结和寻求“帮助”的对象，搞得我颇为尴尬。 下了飞机，一切都是陌生的了。和师兄在一起走的好处就是什么都可以商量着，跟着来。入关的时候，那个officer问我是学什么的。我说学化学的。他略带鄙夷的笑说，化学这么boring，你也学的下去。我只能故作正经的说，我觉得做化学研究很有意思，其实心里有千万只草泥马奔过，哥要是早知道搞研究这么坑，早就转系了，现在上了贼船，只能硬着头皮往前干了。第一次坐城铁，才发现西雅图的城铁没有进站闸口，也没有人查票，全靠自觉。车上也没有多少人，每个人都安安静静的坐着或者小声的和伙伴说着话，偶尔有人牵着小狗上车，小狗在有限的狗绳半径里乱窜，增加了一点活跃的气氛。 西雅图的天气很好，西雅图的天气也并不算好。第一个天气好，是这些年国内饱受雾霾的侵害，天气好坏已经不是小的时候天气晴雨的代名词，而是空气质量好差的代名词。西雅图的空气质量在去的一周里都非常好，虽然采样点过于集中，数据不具有说服力，但是我还是相信这里的空气一定是比国内好了太多，怪不得也是老美最先在中国大使馆开始PM2.5的检测。第二条说西雅图的天气并不算好，才说的天气的晴雨。 和师姐吃了一顿中国的烤鱼。 遇上了一个德国留学的哥们。 和师兄吃了一顿“海鲜啤酒大餐”。 难吃的美国菜。 注：全文都用的是西雅图，而没有泛指美国，因为自己没有到过美国的其他地方，没什么发言权，只是将我在西雅图这短短一周的所见所闻所感如实的记录下来，日后自己翻看的时候，也能想起当时的人和物以及自己的心境。","categories":[],"tags":[{"name":"游记","slug":"游记","permalink":"http://yoursite.com/tags/游记/"}]},{"title":"《七月与安生》观后感","slug":"20161030_七月与安生观后感","date":"2016-10-29T16:00:00.000Z","updated":"2016-11-17T06:43:29.000Z","comments":true,"path":"2016/10/30/20161030_七月与安生观后感/","link":"","permalink":"http://yoursite.com/2016/10/30/20161030_七月与安生观后感/","excerpt":"《七月与安生》确实是一部很不错的电影，没有去电影院支持，简直惭愧。七月与安生。安生，因为从小家庭的残缺，内心敏感脆弱，但却向往强大，对外表现出一个张牙舞爪的坏孩子形象，和谁都可以自来熟；七月，一个乖乖女的形象，外表看似柔弱，不愿意外出闯荡，但是内心坚强。 两个性格完全不同的女孩，却是最好的朋友，因为她们都是一样的善良与真诚。","text":"《七月与安生》确实是一部很不错的电影，没有去电影院支持，简直惭愧。七月与安生。安生，因为从小家庭的残缺，内心敏感脆弱，但却向往强大，对外表现出一个张牙舞爪的坏孩子形象，和谁都可以自来熟；七月，一个乖乖女的形象，外表看似柔弱，不愿意外出闯荡，但是内心坚强。 两个性格完全不同的女孩，却是最好的朋友，因为她们都是一样的善良与真诚。 她们两个人的性格，电影中有数不清的情节或者细节来刻画。比如，安生和七月在高档餐厅吃饭的时候，看到菜单很贵，于是安生“犯贱”的去当酒托，只为了能省一瓶昂贵的红酒钱。之后，又不愿意吃龙虾，只想点一份沙拉，只因为自己的囊中羞涩，又不愿意朋友破费。但是却在和七月吵架之后，悄悄的留下一堆钱（一看就是零钱），坐公交车走了。不想被人可怜，也不想欠别人的，这是安生这样的出生，内心敏感脆弱的人最大的共同点。 七月内心的强大，体现在七月在佳明不接电话后，第二天暗示性的提醒佳明要对爱情忠贞。也体现在在和安生在佳明家大吵一架后，平静的离开，给对方一个月的时间考虑。这还体现在，在结婚前的最后几天，告诉佳明，让他逃婚，因为自己不愿意和不够爱她的人在一起。这更体现在，她知道佳明已经不会回头了，还坚持把孩子生下来… 只有内心真正坚强的女人，才会有这样的智慧，果断，冷静，甚至一意孤行。 给我感觉，安生是一条颤颤巍巍的小船，虽然一直在大海中乘风破浪，但一直想找一个港湾来停靠。而七月，则是一条安静而坚固的船，一旦认准了目标，就会执着的勇往无前。电影结尾处，七月的女儿，一个人把佳明约出来，为了找到她的爸爸，可以看到小小年纪的她的果敢与坚持。这一点，正是七月最大的性格特点。 于我来说，安生惹人疼，七月值得爱。","categories":[],"tags":[{"name":"影记","slug":"影记","permalink":"http://yoursite.com/tags/影记/"}]},{"title":"我青春的记忆里，全部有你","slug":"20161029_我的记忆里全部都有你","date":"2016-10-28T04:00:00.000Z","updated":"2019-02-23T16:05:21.827Z","comments":true,"path":"2016/10/28/20161029_我的记忆里全部都有你/","link":"","permalink":"http://yoursite.com/2016/10/28/20161029_我的记忆里全部都有你/","excerpt":"这两天在看《诛仙青云志》，被里面张小凡，碧瑶的爱情故事虐的不要不要。我最早知道《诛仙》，是在中学，看到班上的同学在看。因为自己一直对仙侠，武侠，玄幻题材为主的网络小说不感兴趣，所以一直没有接触。上了大学后，我爸竟然不知从哪里看到了《诛仙》，然后跑过来向我安利。于是在一个寒假里，第一次翻开了这本小说，当时看的时候肯定是心潮澎湃，我还记得晚上窝在被窝里，能看到凌晨好几点，不愿意睡觉。","text":"这两天在看《诛仙青云志》，被里面张小凡，碧瑶的爱情故事虐的不要不要。我最早知道《诛仙》，是在中学，看到班上的同学在看。因为自己一直对仙侠，武侠，玄幻题材为主的网络小说不感兴趣，所以一直没有接触。上了大学后，我爸竟然不知从哪里看到了《诛仙》，然后跑过来向我安利。于是在一个寒假里，第一次翻开了这本小说，当时看的时候肯定是心潮澎湃，我还记得晚上窝在被窝里，能看到凌晨好几点，不愿意睡觉。 一晃又好久年过去了，从一名大学生，成了一名研究生。前段时间看到了《诛仙青云志》的电视剧，旧时的情怀又涌上心头，正所谓看的不是剧，看的是青春。甚至等不及每天北邮人上9点多的免费更新，而充了腾讯视频的会员专门看8点钟的场。对情节的淡忘，也随着剧情的一步步发展重新变得清晰，不由自主的喜欢上了这一部剧。之前，对李易峰，赵丽颖等演员并不熟悉，也没有看过他们演的电视剧。看了《青云志》之后，才开始百度这两个演员的演艺道路。尤其喜欢赵丽颖演的碧瑶。小说里碧瑶的角色描写的并没有那么出彩，因为和张小凡的感情冲突并没有那么强烈。但是在剧里，编剧把凡瑶的感情线的冲突改写的非常虐心，赵丽颖对碧瑶角色的诠释也十分到位。看了赵丽颖的演艺经历，也算是一个“大气不早成”的人。看她的访谈（其实她很少有访谈），基本上和主持人的对话回合都很短，言语也比较平直和苍白。我承认这确实与她的教育程度不高有关，但是不妨碍我对这个演员的喜欢以及对她塑造的形象的喜欢。因为我觉得教育程度的高低，并不能决定一个人水平的高低。(我自己的亲身体验和园子里的人和事给我的感受，教育程度高并不能决定人生的高度能有多高，决定人生高度的可能是其他一些难能可贵的品质) 轰轰烈烈的剧情，和平时枯燥乏味的科研生活一比简直是我心之向往，但是也知道这样的人生道路只可能出现在小说或者剧本里。人生的道路，多的是日复一日的平淡，在一个很小的空间位置里演绎着不大的喜悲，最多是加一点无关紧要的鸡血，也会是一望无尽的平静水面上的小小涟漪，最终趋于平淡。剧中之人向往平淡的生活，而我们平淡中生活的人却yy着轰轰烈烈。这或许就是《仙剑》里面所传递的只有拿起，才能放下的思想。 我始终觉得我们这一批好好学生，在象牙塔中不断获取书本知识，丰富自己的同时，失去的也是更多体验生活感悟生活的经历。人生其实短暂，可放纵挥霍的日子更是不多，鱼与熊掌的权衡时时刻刻都存在着，如何把握好其中的平衡，才能使自己的人生更加精彩。我现在感到遗憾的是，因为自己的性格缺陷，在这个象牙塔里还要把自己束缚住，没有在大学的前几年多多出去体验一下生活。 一直有写点东西的心愿，曾经想过写一写自己的经历，终是没有迈出第一步。一方面是文笔实在是太烂，竟不能成一文。另一方面，经历太少，日子每天似乎都是一样的。最近有些点小说的冲动，也是感觉有点有心无力。想我这七八年来的青春岁月，唯一做过的可以骄傲的事情，就是在青春里遇见了你，并且突破万难与你在一起。就这一点，如果写成一本书，书的名字就可以叫做《我青春的记忆里，全部有你》。虽不如《诛仙》里张小凡碧瑶那般轰轰烈烈，感天动地，也算是在这平淡的日子里，一起笑，一起闹，相互守护。 曾经，我觉得我们之间已经早已变成了亲情，但是我现在认为，它会一直是爱情。 2016/10/29下午 var ap = new APlayer({ element: document.getElementById(\"aplayer-fWnqJIQv\"), narrow: false, autoplay: true, showlrc: false, music: { title: \"青衣谣\", author: \"郁可唯\", url: \"/music/郁可唯-青衣谣.flac\", pic: \"\", lrc: \"\" } }); window.aplayers || (window.aplayers = []); window.aplayers.push(ap);","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]},{"title":"科研小感-关于知识","slug":"20160812_科研小感-关于知识","date":"2016-08-11T16:00:00.000Z","updated":"2016-11-17T06:50:57.000Z","comments":true,"path":"2016/08/12/20160812_科研小感-关于知识/","link":"","permalink":"http://yoursite.com/2016/08/12/20160812_科研小感-关于知识/","excerpt":"","text":"感觉知识就像一张大的网。在做研究的时候，每当我想创造新知识的时候，即想从这张网的某一个小区域出发往这张网的下面探索的时候，总是感觉被这一区域周围的网所限制，即被那些有千丝万缕关系的知识，但是又不是直接相关的知识所牵绊。如果要把这部分知识也搞懂的话，就又要花很多的力气。这种感觉，让我在搞科研的时候，感到十分的不舒服。到底怎样才能找到一个比较舒服的状态？","categories":[],"tags":[{"name":"科研","slug":"科研","permalink":"http://yoursite.com/tags/科研/"}]},{"title":"家人的北京游","slug":"20160605_家人的北京游","date":"2016-06-05T04:00:00.000Z","updated":"2016-11-17T13:44:44.000Z","comments":true,"path":"2016/06/05/20160605_家人的北京游/","link":"","permalink":"http://yoursite.com/2016/06/05/20160605_家人的北京游/","excerpt":"这一周两个姑妈带着奶奶来到北京游玩，这是奶奶第一次来北京。奶奶出生于1933年，今年已经83岁了，身体和精神状态都非常的好。我之前只是知道奶奶已经过了80了，确切的生日是我用她们的身份证买票的时候才知道的，做孙子的实在是过意不去。 老实说，已经很久没有逛过北京城里的景点了。不像刚来的两三年，每到放假或者清闲的周末会和Sue妹妹计划着逛逛北京的各个地方，北海公园，什刹海公园，南锣鼓巷，美术博物馆，恭王府。自从上了研究生之后，感觉生活的节奏明显不一样了，到了周末不是各个圈子里约着吃饭，就是看电影。能在黑暗的电影院里坐下来安心的看两个小时电影，已经是很好的享受了。连故宫都是这个学期的春天才去的。","text":"这一周两个姑妈带着奶奶来到北京游玩，这是奶奶第一次来北京。奶奶出生于1933年，今年已经83岁了，身体和精神状态都非常的好。我之前只是知道奶奶已经过了80了，确切的生日是我用她们的身份证买票的时候才知道的，做孙子的实在是过意不去。 老实说，已经很久没有逛过北京城里的景点了。不像刚来的两三年，每到放假或者清闲的周末会和Sue妹妹计划着逛逛北京的各个地方，北海公园，什刹海公园，南锣鼓巷，美术博物馆，恭王府。自从上了研究生之后，感觉生活的节奏明显不一样了，到了周末不是各个圈子里约着吃饭，就是看电影。能在黑暗的电影院里坐下来安心的看两个小时电影，已经是很好的享受了。连故宫都是这个学期的春天才去的。 周六早晨6点起床，乘地铁赶到北京站，才发现火车晚点了1个小时。接到她们三个人，首先到了 第一站旅馆网上订了一家西单的速8，去了之后才发现，原来是在很小的胡同里，大概是将几个院子扩充了之后改造起来的宾馆，里面的格局奇小无比。不过趁着这个机会，正好可以游览一下老北京的胡同。 第二站 天安门/故宫天安门和故宫可能是很多来北京游玩的人的首站。从公交车上下来的时候，正好是国家大剧院，记得大二还是大一的时候，来看过一次演出，记得当时是从地铁里直接进去的，没有看到外形，等看完的时候，已经太晚了。这次在外面看似乎也没有宣传页上拍的好看。国家大剧院现在还时不时的给我推送最新的演出，但是每次都没有仔细看一眼，就把那个未读邮件的标记给点掉了。下车的时候，还有一个老爷爷，颤颤巍巍的问我们是不是外地过来的游客，得知我们确实是来北京游玩的时候，还祝我们玩的愉快。顺带着还不忘告诉我们，他是来大剧院看演出的。这么老的老爷爷，一个人来看演出，生活情趣也是蛮高的。记得那次我看的演出，是一部舞蹈剧，弗拉门戈什么的，记得坐在二层侧边的位置，要看清整个舞台还需要挺直身子，伸着头，因为是最便宜的票。还被远处的管理人员用激光笔照了一下，可能是当时用手机拍了照的缘故。 天安门的人并没有上次我和Sue妹妹来的时候那么多。故宫里的人倒是非常多。曾经戒备森严的紫禁城，现在已经被寻常百姓踩出了坑。我唯一记得的，就是每个建筑屋檐上的小兽的数目代表着该宫殿的规格，好像规格最高的乾清宫是9个还是10个小兽。古人的等级观念可见一斑。当今的社会似乎等级的观念被淡化了，但是时不时的在一些角落死灰复燃。中午在故宫食堂吃饭的时候，询问有没有水的时候（正常的饭馆一般都会在上菜之前上一壶开水或者廉价的茶），服务员对我笑了一下说这里是故宫，没有免费的水。这样的笑容似乎在说，故宫这样高贵的地方，免费的水不是自降了身价。再次进入紫禁城的时候，可能是前段时候读完了徐中约的《中国近代史》的上册，感觉这几间屋子在那个时间，是经历了怎样的历史洪流，无能或心有余而力不足的统治者，在这几间屋子里待了上百年，但是一夕之间，失去了所有。 奶奶的脚力可以，竟拒绝租借一个轮椅，让我们去推她。 奶奶在北京待了6天就走了，作为子孙，本应该多陪陪他们的，但是爸爸和我都因为工作和学习，大多的时候都是他们三个人自己在玩。最有时间本来应该是我们，和导师请一声假，和老板请一声假就可以了，他们并不会因为这点事情开除我们，我们从事的工作，也不是没有我们地球不转了。恰恰没有多少时间的，是我们的爷爷奶奶，这些老人，或许这次来了北京之后，奶奶有生之年不会再出这么远的门了。可能这就是生活吧，年轻的时候汲汲于生活，虽然有时候心有愧疚，但是也得硬着头皮往前赶，到老了以后被人所遗忘。 在写这篇文章的时候，我在想，可能最好的生活是这样子，有一份可以养家糊口的，可以胜任的并得到满足的工作，然后尝试更多新鲜的东西，丰富自己的生活。 为什么我们人类总想往前走的太快，总想往前赶。 想想来北京六年了，和家人聚少离多。即使和父亲在同一个城市，见面的频率也就是一个月一次。年少的时候总是想着快快长大，可以不受家庭的束缚，到远方去闯一闯。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]},{"title":"我的博客","slug":"20160605_我的博客","date":"2016-06-05T03:00:00.000Z","updated":"2016-11-17T13:39:02.000Z","comments":true,"path":"2016/06/05/20160605_我的博客/","link":"","permalink":"http://yoursite.com/2016/06/05/20160605_我的博客/","excerpt":"一直想写博客很久了，主要有三个原因，一是因为平时在上网的时候看到好几个有意思的个人博客，有学术的，有人文的（之后会慢慢推荐给大家），觉得自己也可以学习一下,搞一搞；二是因为枯燥单调的博士生活，心情总是时不时的处于亚健康的状态，有时候触景生情，有感而发，也想写上一篇发发牢骚；三是觉得自己写作能力本来就不强，由于搞了理科以后尤其荒疏，每每想写点东西，满腔情感倒不出来，苦不堪言。但是由于本人实在是懒，懒于记录，懒于折腾，所以博客一直没有开起来。","text":"一直想写博客很久了，主要有三个原因，一是因为平时在上网的时候看到好几个有意思的个人博客，有学术的，有人文的（之后会慢慢推荐给大家），觉得自己也可以学习一下,搞一搞；二是因为枯燥单调的博士生活，心情总是时不时的处于亚健康的状态，有时候触景生情，有感而发，也想写上一篇发发牢骚；三是觉得自己写作能力本来就不强，由于搞了理科以后尤其荒疏，每每想写点东西，满腔情感倒不出来，苦不堪言。但是由于本人实在是懒，懒于记录，懒于折腾，所以博客一直没有开起来。 最初考察了新浪博客，但是发现界面简直一塌糊涂，充斥着各种广告弹窗，莫名其妙的推介，十分不符合文艺的气质，所以就萌生了自己搭一个简单的个人博客的想法。网上做了简单的调研，最后选择了”github pages + hexo” 这样一个最简单经济的平台。由于本人一直在Linux系统下工作，构建网站这一套流程倒也不复杂，申请了这个jiajunren.win的域名，10年使用期才只有47块钱，简直白菜价。在这个自媒体的时代，表达自我观点的门槛已经很低很低了。于是决定从今天开始正式开写博客“花的姿态”，基本的目标是每周一篇，可长可短，贵在坚持。 首先说说为什么取名叫“花的姿态”，这本是一首陈绮贞的歌的歌名，在高三后的假期里开始听陈绮贞,觉得这首歌非常不错，很符合当时的心境，还以此歌名写了一篇日志，当时还是qq空间。有机会再说那段时光，也是相当有意思的。 本博客我自己的打算主要是记录两方面内容吧，就像我上面提到的开博客的三个原因，一个是学术上的，记录一些科研上的点滴；二是生活上的，记录一些生活中开心的，不开心的事情。","categories":[],"tags":[{"name":"其他","slug":"其他","permalink":"http://yoursite.com/tags/其他/"}]}]}